app/views/employees/new.html.erb

  <% form.label :position %>
  <%= form.collection_select :position_id, Position.all, :id, :name %>
---
SELECT "positions".* FROM "positions"