app/views/employees/show.html.erb

      <td>
        <% if @employee.attendance_records.last.present? %>
          <%= @employee.attendance_records.last.clock_in_time.strftime('%H:%M:%S') %>
---
SELECT "attendance_records".* FROM "attendance_records" WHERE "attendance_records"."employee_id" = ? ORDER BY "attendance_records"."id" DESC LIMIT ?  [["employee_id", 4], ["LIMIT", 1]]

      <td>
        <% if @employee.attendance_records.last.present? && @employee.attendance_records.last.clock_out_time.present? %>
          <%= @employee.attendance_records.last.clock_out_time.strftime('%H:%M:%S') %>
---
SELECT "attendance_records".* FROM "attendance_records" WHERE "attendance_records"."employee_id" = ? ORDER BY "attendance_records"."id" DESC LIMIT ?  [["employee_id", 4], ["LIMIT", 1]]

      <td>
        <% if @employee.attendance_records.last.present? && @employee.attendance_records.last.clock_out_time.present? %>
          <% working_minutes = @employee.attendance_records.last.calculate_working_hours[:hours] * 60 + @employee.attendance_records.last.calculate_working_hours[:minutes] %>
---
SELECT "attendance_records".* FROM "attendance_records" WHERE "attendance_records"."employee_id" = ? ORDER BY "attendance_records"."id" DESC LIMIT ?  [["employee_id", 4], ["LIMIT", 1]]

      <td>
        <% if @employee.attendance_records.last.present? && @employee.attendance_records.last.clock_out_time.present? %>
          <%= @employee.attendance_records.last.calculate_salary(@employee.hourly_wage) %> 円
---
SELECT "attendance_records".* FROM "attendance_records" WHERE "attendance_records"."employee_id" = ? ORDER BY "attendance_records"."id" DESC LIMIT ?  [["employee_id", 4], ["LIMIT", 1]]