app/helpers/sessions_helper.rb

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def current_employee
    @current_employee ||= Employee.find_by(id: session[:employee_id])