app/controllers/attendances_controller.rb

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "attendance_records" ("employee_id", "work_date", "clock_in_time", "clock_out_time", "working_hours", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    employee = Employee.find(params[:employee_id])
    attendance = AttendanceRecord.new(employee: employee, clock_in_time: Time.current)

    if attendance.save