app/controllers/employees_controller.rb

  def index
    # トップ画面の表示に必要な処理を記述
    @employees = Employee.all
---
SELECT "employees".* FROM "employees"

  def create
    @employee = Employee.new(employee_params)

    if @employee.save
---
INSERT INTO "employees" ("name", "email", "password", "login_id", "bank_account", "position_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update_attendance
    # 退勤時の処理をここに追加
    employee = Employee.find(params[:id])
    attendance_record = employee.attendance_records.last
    if attendance_record.present?
        attendance_record.clock_out_time = Time.current
        working_hours = attendance_record.calculate_working_hours
        print "退勤時間のところ + #{working_hours[:minutes]}"
        attendance_record.update(
          clock_out_time: attendance_record.clock_out_time,
          work_date: Date.current,
          working_hours: working_hours[:hours] * 60 + working_hours[:minutes]
        )
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "attendance_records".* FROM "attendance_records" WHERE "attendance_records"."employee_id" = ? ORDER BY "attendance_records"."id" DESC LIMIT ?  [["employee_id", 4], ["LIMIT", 1]]
UPDATE "attendance_records" SET "work_date" = ?, "clock_out_time" = ?, "working_hours" = ?, "updated_at" = ? WHERE "attendance_records"."id" = ?  [["work_date", "2024-02-13"], ["clock_out_time", "2000-01-01 15:10:39.882646"], ["working_hours", -1361.0], ["updated_at", "2024-02-12 15:10:39.887398"], ["id", 38]]

  def salary_statement
    @employee = Employee.find(params[:id])
    @attendance_records = @employee.attendance_records.where("strftime('%m', work_date) = ?", Date.current.strftime('%m'))
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "attendance_records".* FROM "attendance_records" WHERE "attendance_records"."employee_id" = ? AND (extract(month from work_date) = 2)  [["employee_id", 4]]