app/controllers/sessions_controller.rb

  def create
    if params[:session].present?
      employee = Employee.find_by(login_id: params[:session][:login_id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."login_id" = ? LIMIT ?  [["login_id", "mihomiho"], ["LIMIT", 1]]